# === Taps ===

tap "colindean/fonts-nonfree"
tap "drud/ddev"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "saulpw/vd"
tap "zaquestion/tap"

# === Casks ===

# Fonts
cask "font-cascadia-code"
cask "font-cascadia-code-pl"
cask "font-cascadia-mono"
cask "font-cascadia-mono-pl"
cask "font-fira-code-nerd-font"
cask "font-hack"
cask "font-inconsolata"
cask "font-jetbrains-mono"
#cask "font-microsoft-office"

# IDEs
cask "phpstorm"
cask "sublime-text"
cask "visual-studio-code"

# Developer Tools
cask "docker"
cask "fork"
cask "gitup"
cask "imageoptim"
cask "iterm2"
cask "lando"
cask "lens"
cask "meld"
cask "mongodb-compass"
cask "postman"
cask "sequel-ace"
cask "sublime-merge"
cask "vagrant"
cask "virtualbox"

# Browsers
cask "choosy"
cask "google-chrome"
cask "firefox"
cask "microsoft-edge"

# Work Tools
cask "dropbox"
cask "evernote"
#cask "gnucash"
#cask "grammarly"
cask "itsycal"
cask "lastpass"
cask "microsoft-office"
cask "notion"
cask "skitch"
cask "skype"
cask "slack"
cask "zoom"

# System Utilities
cask "authy"
#cask "ccleaner"
#cask "commander-one"
cask "disk-inventory-x"
cask "divvy"
#cask "flux"
cask "istat-menus"
#cask "karabiner-elements"
cask "krisp"
cask "mounty"
cask "obsidian"
cask "pock"
cask "rectangle"
cask "the-unarchiver"
cask "vanilla"

# Media
cask "adobe-acrobat-reader"
cask "adobe-creative-cloud"
#cask "edex-ui"
cask "kap"
cask "kid3"
cask "gimp"
cask "handbrake"
#cask "jubler"
cask "obs"
cask "paintbrush"
cask "vlc"

# Misc
#cask "steam"
cask "osxfuse"
cask "buttercup"

# === Formulae ===

brew "ansible"
brew "awscli"
brew "bash"
brew "bat"
brew "bpytop"
brew "brew-cask-completion"
brew "gettext"
brew "composer"
brew "coreutils"
brew "ctop"
brew "dnsmasq", restart_service: true
brew "docker-completion"
brew "doctl"
brew "exa"
brew "exercism"
brew "fd"
brew "ffmpeg"
brew "fx"
brew "fzf"
brew "fish"
brew "gd"
brew "git"
brew "git-delta"
brew "git-extras"
brew "gnupg"
brew "gnu-sed"
brew "go"
brew "gpatch"
brew "graphviz"
brew "helm"
brew "highlight"
brew "htop"
brew "hub"
brew "jq"
brew "kubernetes-cli"
brew "lab"
brew "lastpass-cli"
brew "lazygit"
brew "librsvg"
brew "libxml2"
brew "readline"
brew "mackup"
brew "mas"
brew "mkcert"
brew "mosh"
brew "node"
#brew "ntfs-3g"
brew "openssl"
brew "php"
brew "php@7.4"
brew "pinentry"
brew "pinentry-mac"
brew "pipenv"
brew "pv"
brew "python3"
brew "python@3.9"
brew "ripgrep"
brew "rustup-init"
#brew "shellcheck"
brew "sqlite"
brew "ssh-copy-id"
brew "starship"
brew "terminal-notifier"
brew "terraform"
brew "the_silver_searcher"
brew "tig"
brew "tree"
brew "visidata"
brew "watch"
brew "wget"
brew "xz"
brew "yarn"
brew "youtube-dl"
brew "drud/ddev/ddev"

# === Mac App Store Applications ===
#mas 'Monosnap', id: 540348655
mas 'Todoist', id: 585829637
mas 'World Clock Pro', id: 858446756
