# === Taps ===

tap "colindean/fonts-nonfree"
tap "drud/ddev"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-fonts"
tap "homebrew/fuse"
tap "homebrew/services"

# === Casks ===

# Fonts
cask "font-cascadia"
cask "font-inconsolata"
cask "font-jetbrains-mono"

# IDEs
cask "phpstorm"
cask "sublime-text"
cask "visual-studio-code"

# Developer Tools
cask "docker"
cask "fork"
cask "hyper"
cask "imageoptim"
cask "iterm2"
cask "kdiff3"
cask "keybase"
cask "lando"
cask "meld"
cask "mongodb-compass-community"
cask "postman"
cask "sequel-pro"
cask "sublime-merge"
cask "vagrant"
cask "virtualbox"

# Browsers
cask "google-chrome"
cask "firefox"
cask "microsoft-edge"

# Work Tools
cask "dropbox"
cask "evernote"
#cask "gnucash"
cask "google-backup-and-sync"
cask "google-drive"
#cask "grammarly"
cask "itsycal"
cask "lastpass"
cask "microsoft-office"
cask "notion"
cask "onedrive"
#cask "rambox"
cask "slack"
cask "zoomus"

# System Utilities
cask "authy"
cask "commander-one"
cask "divvy"
#cask "flux"
cask "karabiner-elements"
cask "krisp"
cask "pock"
cask "spectacle"
cask "the-clock"
cask "the-unarchiver"

# Media
cask "adobe-acrobat-reader"
cask "adobe-creative-cloud"
cask "kid3"
cask "gimp"
cask "handbrake"
#cask "jubler"
cask "paintbrush"
cask "vlc"

# Misc
#cask "steam"
cask "osxfuse"
cask "buttercup"
cask "colindean/fonts-nonfree/font-microsoft-office"

# === Formulae ===

brew "ansible"
brew "awscli"
brew "bash"
brew "brew-cask-completion"
brew "gettext"
brew "composer"
brew "coreutils"
brew "dep"
brew "dnsmasq", restart_service: true
brew "docker-completion"
brew "exercism"
brew "ffmpeg"
brew "fx"
brew "fish"
brew "gd"
brew "git"
brew "gnupg"
brew "gnu-sed", args: ["with-default-names"]
brew "go"
brew "gpatch"
brew "graphviz"
brew "highlight"
brew "htop"
brew "hub"
brew "jq"
brew "kubernetes-cli"
brew "librsvg"
brew "libxml2"
brew "readline"
brew "mas"
brew "mkcert"
brew "mosh"
brew "node"
brew "ntfs-3g"
brew "openssl"
brew "php"
brew "pinentry"
brew "pinentry-mac"
brew "pv"
brew "python"
brew "ripgrep"
brew "shellcheck"
brew "ssh-copy-id"
brew "terminal-notifier"
brew "terraform"
brew "tig"
brew "tree"
brew "watch"
brew "wget"
brew "xz"
brew "yarn"
brew "youtube-dl"
brew "drud/ddev/ddev"

# === Mac App Store Applications ===
mas 'GIPHY Capture', id: 668208984
mas 'Monosnap', id: 540348655
mas 'Todoist', id: 585829637
